Revit 2026 API

# RebarShapeDefinitionByArcSetConstraints Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetConstraints(
	IList<RebarShapeConstraint> constraints
)
```
```vb
Public Sub SetConstraints (
	constraints As IList(Of RebarShapeConstraint)
)
```
```cpp
public:
void SetConstraints(
	IList<RebarShapeConstraint^>^ constraints
)
```
```fsharp
member SetConstraints :
        constraints : IList<RebarShapeConstraint> -> unit
```

#### Parameters

constraints IListRebarShapeConstraint

#### Reference

RebarShapeDefinitionByArc Class

Autodesk.Revit.DB.Structure Namespace